dannyf00/ARMduino/LPC122x/armduino_lpc12xx.c
//hardware specific port for ARMduino to lpc12xx family

#include "armduino_lpc12xx.h"						//we use aruidno GPIO port for lpc12xx
#include "armduino.h"								//use ARMduino specific definitions

//global definitions

#define PWM_PR			((1ul<<PWMOUT_BITs) - 1)			//period for 16-bit pwm

//struct used to map a pin to GPIO+mask
typedef struct {
	LPC_GPIO_Type *gpio;				//gpio for a pin
	uint32_t mask;						//pin mask - 32bit
} PIN2GPIO;


//empty handler
static void empty_handler(void) {
	//do nothing here
}

#if defined(USE_EXTI)
//user isr
void (*_isrptr_exti[16])(void);			//user handler for EXTI interrupt

//exti interrupt handlers
void EXTI0_IRQHandler(void) {
	EXTI->PR |= (1<<0);					//clear the flag by writing '1' to it
	_isrptr_exti[0]();					//execute the user handler
}

void EXTI1_IRQHandler(void) {
	EXTI->PR |= (1<<1);					//clear the flag by writing '1' to it
	_isrptr_exti[1]();					//execute the user handler
}

void EXTI2_IRQHandler(void) {
	EXTI->PR |= (1<<2);					//clear the flag by writing '1' to it
	_isrptr_exti[2]();					//execute the user handler
}

void EXTI3_IRQHandler(void) {
	EXTI->PR |= (1<<3);					//clear the flag by writing '1' to it
	_isrptr_exti[3]();					//execute the user handler
}

void EXTI4_IRQHandler(void) {
	EXTI->PR |= (1<<4);					//clear the flag by writing '1' to it
	_isrptr_exti[4]();					//execute the user handler
}

void EXTI9_5_IRQHandler(void) {
	if (EXTI->PR & (1<<5)) {
		EXTI->PR |= (1<<5);				//clear the flag by writing '1' to it
		_isrptr_exti[5]();				//execute the user handler
	}

	if (EXTI->PR & (1<<6)) {
		EXTI->PR |= (1<<6);				//clear the flag by writing '1' to it
		_isrptr_exti[6]();				//execute the user handler
	}

	if (EXTI->PR & (1<<7)) {
		EXTI->PR |= (1<<7);				//clear the flag by writing '1' to it
		_isrptr_exti[7]();				//execute the user handler
	}

	if (EXTI->PR & (1<<8)) {
		EXTI->PR |= (1<<8);				//clear the flag by writing '1' to it
		_isrptr_exti[8]();				//execute the user handler
	}

	if (EXTI->PR & (1<<9)) {
		EXTI->PR |= (1<<9);				//clear the flag by writing '1' to it
		_isrptr_exti[9]();				//execute the user handler
	}
}

void EXTI15_10_IRQHandler(void) {
	if (EXTI->PR & (1<<10)) {
		EXTI->PR |= (1<<10);			//clear the flag by writing '1' to it
		_isrptr_exti[10]();				//execute the user handler
	}

	if (EXTI->PR & (1<<11)) {
		EXTI->PR |= (1<<11);			//clear the flag by writing '1' to it
		_isrptr_exti[11]();				//execute the user handler
	}

	if (EXTI->PR & (1<<12)) {
		EXTI->PR |= (1<<12);			//clear the flag by writing '1' to it
		_isrptr_exti[12]();				//execute the user handler
	}

	if (EXTI->PR & (1<<13)) {
		EXTI->PR |= (1<<13);			//clear the flag by writing '1' to it
		_isrptr_exti[13]();				//execute the user handler
	}

	if (EXTI->PR & (1<<14)) {
		EXTI->PR |= (1<<14);			//clear the flag by writing '1' to it
		_isrptr_exti[14]();				//execute the user handler
	}

	if (EXTI->PR & (1<<15)) {
		EXTI->PR |= (1<<15);			//clear the flag by writing '1' to it
		_isrptr_exti[15]();				//execute the user handler
	}
}
//end exti handlers
#endif

//global variables
//define your chips here
//declare pins based on chip packaging
//ALL PINS ARE MAPPED, WHETHER THEY EXIST OR NOT
//*********************************************************
//SO MAKE SURE THAT THE PINS YOU PICKED ACTUALLY EXIST FOR YOUR CHIP/PACKAGE
//*********************************************************
//Pin  0..15 -> GPIOA
//Pin 16..31 -> GPIOB
//Pin 32..47 -> GPIOC
//Pin 48..63 -> GPIOD
//Pin 64..79 -> GPIOE
//Pin 80..95 -> GPIOF
//Pin 96..111 -> GPIOG
const PIN2GPIO GPIO_PinDef[]={
		{LPC_GPIO0, 1<< 0},						//ARMduino Pin  0 = P0_0
		{LPC_GPIO0, 1<< 1},						//ARMduino Pin  1 = P0_1
		{LPC_GPIO0, 1<< 2}, 					//ARMduino Pin  2 = P0_2
		{LPC_GPIO0, 1<< 3},						//ARMduino Pin  3 = P0_3
		{LPC_GPIO0, 1<< 4},						//ARMduino Pin  4 = P0_4
		{LPC_GPIO0, 1<< 5},						//ARMduino Pin  5 = P0_5
		{LPC_GPIO0, 1<< 6},						//ARMduino Pin  6 = P0_6
		{LPC_GPIO0, 1<< 7},						//ARMduino Pin  7 = P0_7
		{LPC_GPIO0, 1<< 8},						//ARMduino Pin  8 = P0_8
		{LPC_GPIO0, 1<< 9},						//ARMduino Pin  9 = P0_9
		{LPC_GPIO0, 1<<10},						//ARMduino Pin 10 = P0_10
		{LPC_GPIO0, 1<<11},						//ARMduino Pin 11 = P0_11
		{LPC_GPIO0, 1<<12},						//ARMduino Pin 12 = P0_12
		{LPC_GPIO0, 1<<13},						//ARMduino Pin 13 = P0_13
		{LPC_GPIO0, 1<<14},						//ARMduino Pin 14 = P0_14
		{LPC_GPIO0, 1<<15},						//ARMduino Pin 15 = P0_15
		{LPC_GPIO0, 1<<16},						//ARMduino Pin  0 = P0_16
		{LPC_GPIO0, 1<<17},						//ARMduino Pin  1 = P0_17
		{LPC_GPIO0, 1<<18}, 					//ARMduino Pin  2 = P0_18
		{LPC_GPIO0, 1<<19},						//ARMduino Pin  3 = P0_19
		{LPC_GPIO0, 1<<20},						//ARMduino Pin  4 = P0_20
		{LPC_GPIO0, 1<<21},						//ARMduino Pin  5 = P0_21
		{LPC_GPIO0, 1<<22},						//ARMduino Pin  6 = P0_22
		{LPC_GPIO0, 1<<23},						//ARMduino Pin  7 = P0_23
		{LPC_GPIO0, 1<<24},						//ARMduino Pin  8 = P0_24
		{LPC_GPIO0, 1<<25},						//ARMduino Pin  9 = P0_25
		{LPC_GPIO0, 1<<26},						//ARMduino Pin 10 = P0_26
		{LPC_GPIO0, 1<<27},						//ARMduino Pin 11 = P0_27
		{LPC_GPIO0, 1<<28},						//ARMduino Pin 12 = P0_28
		{LPC_GPIO0, 1<<29},						//ARMduino Pin 13 = P0_29
		{LPC_GPIO0, 1<<30},						//ARMduino Pin 14 = P0_30
		{LPC_GPIO0, 1<<31},						//ARMduino Pin 15 = P0_31

		{LPC_GPIO1, 1<< 0},						//ARMduino Pin  0 = P1_0
		{LPC_GPIO1, 1<< 1},						//ARMduino Pin  1 = P1_1
		{LPC_GPIO1, 1<< 2}, 					//ARMduino Pin  2 = P1_2
		{LPC_GPIO1, 1<< 3},						//ARMduino Pin  3 = P1_3
		{LPC_GPIO1, 1<< 4},						//ARMduino Pin  4 = P1_4
		{LPC_GPIO1, 1<< 5},						//ARMduino Pin  5 = P1_5
		{LPC_GPIO1, 1<< 6},						//ARMduino Pin  6 = P1_6
		{LPC_GPIO1, 1<< 7},						//ARMduino Pin  7 = P1_7
		{LPC_GPIO1, 1<< 8},						//ARMduino Pin  8 = P1_8
		{LPC_GPIO1, 1<< 9},						//ARMduino Pin  9 = P1_9
		{LPC_GPIO1, 1<<10},						//ARMduino Pin 10 = P1_10
		{LPC_GPIO1, 1<<11},						//ARMduino Pin 11 = P1_11
		{LPC_GPIO1, 1<<12},						//ARMduino Pin 12 = P1_12
		{LPC_GPIO1, 1<<13},						//ARMduino Pin 13 = P1_13
		{LPC_GPIO1, 1<<14},						//ARMduino Pin 14 = P1_14
		{LPC_GPIO1, 1<<15},						//ARMduino Pin 15 = P1_15
		{LPC_GPIO1, 1<<16},						//ARMduino Pin  0 = P1_16
		{LPC_GPIO1, 1<<17},						//ARMduino Pin  1 = P1_17
		{LPC_GPIO1, 1<<18}, 					//ARMduino Pin  2 = P1_18
		{LPC_GPIO1, 1<<19},						//ARMduino Pin  3 = P1_19
		{LPC_GPIO1, 1<<20},						//ARMduino Pin  4 = P1_20
		{LPC_GPIO1, 1<<21},						//ARMduino Pin  5 = P1_21
		{LPC_GPIO1, 1<<22},						//ARMduino Pin  6 = P1_22
		{LPC_GPIO1, 1<<23},						//ARMduino Pin  7 = P1_23
		{LPC_GPIO1, 1<<24},						//ARMduino Pin  8 = P1_24
		{LPC_GPIO1, 1<<25},						//ARMduino Pin  9 = P1_25
		{LPC_GPIO1, 1<<26},						//ARMduino Pin 10 = P1_26
		{LPC_GPIO1, 1<<27},						//ARMduino Pin 11 = P1_27
		{LPC_GPIO1, 1<<28},						//ARMduino Pin 12 = P1_28
		{LPC_GPIO1, 1<<29},						//ARMduino Pin 13 = P1_29
		{LPC_GPIO1, 1<<30},						//ARMduino Pin 14 = P1_30
		{LPC_GPIO1, 1<<31},						//ARMduino Pin 15 = P1_31

		{LPC_GPIO2, 1<< 0},						//ARMduino Pin  0 = P2_0
		{LPC_GPIO2, 1<< 1},						//ARMduino Pin  1 = P2_1
		{LPC_GPIO2, 1<< 2}, 					//ARMduino Pin  2 = P2_2
		{LPC_GPIO2, 1<< 3},						//ARMduino Pin  3 = P2_3
		{LPC_GPIO2, 1<< 4},						//ARMduino Pin  4 = P2_4
		{LPC_GPIO2, 1<< 5},						//ARMduino Pin  5 = P2_5
		{LPC_GPIO2, 1<< 6},						//ARMduino Pin  6 = P2_6
		{LPC_GPIO2, 1<< 7},						//ARMduino Pin  7 = P2_7
		{LPC_GPIO2, 1<< 8},						//ARMduino Pin  8 = P2_8
		{LPC_GPIO2, 1<< 9},						//ARMduino Pin  9 = P2_9
		{LPC_GPIO2, 1<<10},						//ARMduino Pin 10 = P2_10
		{LPC_GPIO2, 1<<11},						//ARMduino Pin 11 = P2_11
		{LPC_GPIO2, 1<<12},						//ARMduino Pin 12 = P2_12
		{LPC_GPIO2, 1<<13},						//ARMduino Pin 13 = P2_13
		{LPC_GPIO2, 1<<14},						//ARMduino Pin 14 = P2_14
		{LPC_GPIO2, 1<<15},						//ARMduino Pin 15 = P2_15
		{LPC_GPIO2, 1<<16},						//ARMduino Pin  0 = P2_16
		{LPC_GPIO2, 1<<17},						//ARMduino Pin  1 = P2_17
		{LPC_GPIO2, 1<<18}, 					//ARMduino Pin  2 = P2_18
		{LPC_GPIO2, 1<<19},						//ARMduino Pin  3 = P2_19
		{LPC_GPIO2, 1<<20},						//ARMduino Pin  4 = P2_20
		{LPC_GPIO2, 1<<21},						//ARMduino Pin  5 = P2_21
		{LPC_GPIO2, 1<<22},						//ARMduino Pin  6 = P2_22
		{LPC_GPIO2, 1<<23},						//ARMduino Pin  7 = P2_23
		{LPC_GPIO2, 1<<24},						//ARMduino Pin  8 = P2_24
		{LPC_GPIO2, 1<<25},						//ARMduino Pin  9 = P2_25
		{LPC_GPIO2, 1<<26},						//ARMduino Pin 10 = P2_26
		{LPC_GPIO2, 1<<27},						//ARMduino Pin 11 = P2_27
		{LPC_GPIO2, 1<<28},						//ARMduino Pin 12 = P2_28
		{LPC_GPIO2, 1<<29},						//ARMduino Pin 13 = P2_29
		{LPC_GPIO2, 1<<30},						//ARMduino Pin 14 = P2_30
		{LPC_GPIO2, 1<<31},						//ARMduino Pin 15 = P2_31
#if defined(LPC_GPIO3)
		{LPC_GPIO3, 1<< 0},						//ARMduino Pin  0 = P3_0
		{LPC_GPIO3, 1<< 1},						//ARMduino Pin  1 = P3_1
		{LPC_GPIO3, 1<< 2}, 					//ARMduino Pin  2 = P3_2
		{LPC_GPIO3, 1<< 3},						//ARMduino Pin  3 = P3_3
		{LPC_GPIO3, 1<< 4},						//ARMduino Pin  4 = P3_4
		{LPC_GPIO3, 1<< 5},						//ARMduino Pin  5 = P3_5
		{LPC_GPIO3, 1<< 6},						//ARMduino Pin  6 = P3_6
		{LPC_GPIO3, 1<< 7},						//ARMduino Pin  7 = P3_7
		{LPC_GPIO3, 1<< 8},						//ARMduino Pin  8 = P3_8
		{LPC_GPIO3, 1<< 9},						//ARMduino Pin  9 = P3_9
		{LPC_GPIO3, 1<<10},						//ARMduino Pin 10 = P3_10
		{LPC_GPIO3, 1<<11},						//ARMduino Pin 11 = P3_11
		{LPC_GPIO3, 1<<12},						//ARMduino Pin 12 = P3_12
		{LPC_GPIO3, 1<<13},						//ARMduino Pin 13 = P3_13
		{LPC_GPIO3, 1<<14},						//ARMduino Pin 14 = P3_14
		{LPC_GPIO3, 1<<15},						//ARMduino Pin 15 = P3_15
		{LPC_GPIO3, 1<<16},						//ARMduino Pin  0 = P3_16
		{LPC_GPIO3, 1<<17},						//ARMduino Pin  1 = P3_17
		{LPC_GPIO3, 1<<18}, 					//ARMduino Pin  2 = P3_18
		{LPC_GPIO3, 1<<19},						//ARMduino Pin  3 = P3_19
		{LPC_GPIO3, 1<<20},						//ARMduino Pin  4 = P3_20
		{LPC_GPIO3, 1<<21},						//ARMduino Pin  5 = P3_21
		{LPC_GPIO3, 1<<22},						//ARMduino Pin  6 = P3_22
		{LPC_GPIO3, 1<<23},						//ARMduino Pin  7 = P3_23
		{LPC_GPIO3, 1<<24},						//ARMduino Pin  8 = P3_24
		{LPC_GPIO3, 1<<25},						//ARMduino Pin  9 = P3_25
		{LPC_GPIO3, 1<<26},						//ARMduino Pin 10 = P3_26
		{LPC_GPIO3, 1<<27},						//ARMduino Pin 11 = P3_27
		{LPC_GPIO3, 1<<28},						//ARMduino Pin 12 = P3_28
		{LPC_GPIO3, 1<<29},						//ARMduino Pin 13 = P3_29
		{LPC_GPIO3, 1<<30},						//ARMduino Pin 14 = P3_30
		{LPC_GPIO3, 1<<31},						//ARMduino Pin 15 = P3_31
#endif
};

//configure gpio DDR mode (cnf1..0 + mod1..0 bits)
void GPIO_DDR(LPC_GPIO_Type * gpio, uint32_t mask, uint32_t mode) {
	__IO uint32_t *pio;							//pointer to LPC_IOCON->PIOx_y

	//set/clear output direction register
	if (mode & GPIOMODE_OUT) gpio->DIR |= mask; else gpio->DIR &=~mask;
	//find out PIOx_y associated with the mask
	if (gpio == LPC_GPIO0) {
		if (mask & (1ul <<  0)) pio = &(LPC_IOCON->PIO0_0);
		else if (mask & (1ul <<  1)) pio = &(LPC_IOCON->PIO0_1);
		else if (mask & (1ul <<  2)) pio = &(LPC_IOCON->PIO0_2);
		else if (mask & (1ul <<  3)) pio = &(LPC_IOCON->PIO0_3);
		else if (mask & (1ul <<  4)) pio = &(LPC_IOCON->PIO0_4);
		else if (mask & (1ul <<  5)) pio = &(LPC_IOCON->PIO0_5);
		else if (mask & (1ul <<  6)) pio = &(LPC_IOCON->PIO0_6);
		else if (mask & (1ul <<  7)) pio = &(LPC_IOCON->PIO0_7);
		else if (mask & (1ul <<  8)) pio = &(LPC_IOCON->PIO0_8);
		else if (mask & (1ul <<  9)) pio = &(LPC_IOCON->PIO0_9);
		else if (mask & (1ul << 10)) pio = &(LPC_IOCON->PIO0_10);
		else if (mask & (1ul << 11)) pio = &(LPC_IOCON->PIO0_11);
		else if (mask & (1ul << 12)) pio = &(LPC_IOCON->PIO0_12);
		else if (mask & (1ul << 13)) pio = &(LPC_IOCON->RESET_PIO0_13);
		else if (mask & (1ul << 14)) pio = &(LPC_IOCON->PIO0_14);
		else if (mask & (1ul << 15)) pio = &(LPC_IOCON->PIO0_15);
		else if (mask & (1ul << 16)) pio = &(LPC_IOCON->PIO0_16);
		else if (mask & (1ul << 17)) pio = &(LPC_IOCON->PIO0_17);
		else if (mask & (1ul << 18)) pio = &(LPC_IOCON->PIO0_18);
		else if (mask & (1ul << 19)) pio = &(LPC_IOCON->PIO0_19);
		else if (mask & (1ul << 20)) pio = &(LPC_IOCON->PIO0_20);
		else if (mask & (1ul << 21)) pio = &(LPC_IOCON->PIO0_21);
		else if (mask & (1ul << 22)) pio = &(LPC_IOCON->PIO0_22);
		else if (mask & (1ul << 23)) pio = &(LPC_IOCON->PIO0_23);
		else if (mask & (1ul << 24)) pio = &(LPC_IOCON->PIO0_24);
		//else if (mask & (1ul << 25)) pio = &(LPC_IOCON->PIO0_25);
		//else if (mask & (1ul << 26)) pio = &(LPC_IOCON->PIO0_26);
		else if (mask & (1ul << 27)) pio = &(LPC_IOCON->PIO0_27);
		else if (mask & (1ul << 28)) pio = &(LPC_IOCON->PIO0_28);
		else if (mask & (1ul << 29)) pio = &(LPC_IOCON->PIO0_29);
		//else if (mask & (1ul << 30)) pio = &(LPC_IOCON->PIO0_30);
		//else if (mask & (1ul << 31)) pio = &(LPC_IOCON->PIO0_31);
	}
	else if (gpio == LPC_GPIO1) {}
	else if (gpio == LPC_GPIO2) {}
#if defined(LPC_GPIO3)
#endif
	//set the pull-up/floating
	if (mode & GPIOMODE_PU) *pio |= (1ul<<4); else *pio &=~(1ul<<4); if (mode & GPIOMODE_AN) *pio &=~(1ul<<7); else *pio |= (1ul<<7);
}

//Arduino Functions: GPIO
//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	//simple implementation - just INPUT/OUTPUT supported
	//if (mode==INPUT) GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	//else GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);

	//fancier implementation: supports INPUT, INPUT_PULLUP, OUTPUT
	//additional features commented out
	switch (mode) {
	case INPUT: 		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_IN); break;			//floating input
	case INPUT_PULLUP: 	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_IN | GPIOMODE_PU); break;			//input with pullup
	//case INPUT_PULLDN:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INDN); break;			//input with pulldown
	//case INPUT_ANALOG:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INAN); break;			//analog input
	case OUTPUT:		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_OUT); break;			//floating input
	//case OUTPUT_OD:		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_OUTOD); break;			//floating input
	//case OUTPUT_AFPP:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFPP); break;			//floating input
	//case OUTPUT_AFOD:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFOD); break;			//floating input
	default: break;			//do nothing
	}

