dannyf00/ARMduino/LPC122x/armduino_lpc12xx.c
}

//set / clear a pin
inline void digitalWrite(PIN_TypeDef pin, uint8_t val) {
	if (val==LOW) GIO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else GIO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
}

//read a pin
inline int digitalRead(PIN_TypeDef pin) {
	return (GIO_GET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
}
//end GPIO

#if defined(USE_PWM)
//analogWrite
void analogWrite(PIN_TypeDef pin, uint16_t dc) {
	dc=(dc>PWM_PR)?PWM_PR:dc;				//bound dc to [0..PWM_PR]
	switch (pin) {							//configure TIMx-OCi channels based on pin # -> for STM32F100
#if defined(TIM1)
	case PA8:									//pin 8 = PA8/TIM1-CH1
		GIO_AFPP(GPIO_PinDef[8].gpio, GPIO_PinDef[8].mask);
		TIM1->CCR1 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PA9:									//pin 9 = PA9/TIM1-CH2
		GIO_AFPP(GPIO_PinDef[9].gpio, GPIO_PinDef[9].mask);
		TIM1->CCR2 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PA10:								//pin 10 = PA10/TIM1-CH3
		GIO_AFPP(GPIO_PinDef[10].gpio, GPIO_PinDef[10].mask);
		TIM1->CCR3 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PA11:								//pin 11 = PA11/TIM1-CH4
		GIO_AFPP(GPIO_PinDef[11].gpio, GPIO_PinDef[11].mask);
		TIM1->CCR4 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM2)
	case PA1:									//pin 1 = PA1/TIM2-CH2
		GIO_AFPP(GPIO_PinDef[1].gpio, GPIO_PinDef[1].mask);
		TIM2->CCR2 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PA2:									//pin 2 = PA2/TIM2-CH3
		GIO_AFPP(GPIO_PinDef[2].gpio, GPIO_PinDef[2].mask);
		TIM2->CCR3 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PA3:									//pin 3 = PA3/TIM2-CH4
		GIO_AFPP(GPIO_PinDef[3].gpio, GPIO_PinDef[3].mask);
		TIM2->CCR4 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM3)
	case PA6:									//pin 6 = PA6/TIM3-CH1
		GIO_AFPP(GPIO_PinDef[6].gpio, GPIO_PinDef[6].mask);
		TIM3->CCR1 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PA7:									//pin 7 = PA7/TIM3-CH2
		GIO_AFPP(GPIO_PinDef[7].gpio, GPIO_PinDef[7].mask);
		TIM3->CCR2 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PB0:								//pin 16 = PB0/TIM3-CH3
		GIO_AFPP(GPIO_PinDef[16].gpio, GPIO_PinDef[16].mask);
		TIM3->CCR3 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PB1:								//pin 17 = PB1/TIM3-CH4
		GIO_AFPP(GPIO_PinDef[17].gpio, GPIO_PinDef[17].mask);
		TIM3->CCR4 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM4)
	case PB6:								//pin 22 = PB6/TIM4-CH1
		GIO_AFPP(GPIO_PinDef[22].gpio, GPIO_PinDef[22].mask);
		TIM4->CCR1 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PB7:								//pin 23 = PB7/TIM4-CH2
		GIO_AFPP(GPIO_PinDef[23].gpio, GPIO_PinDef[23].mask);
		TIM4->CCR2 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PB8:								//pin 24 = PB8/TIM4-CH3
		GIO_AFPP(GPIO_PinDef[24].gpio, GPIO_PinDef[24].mask);
		TIM4->CCR3 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PB9:								//pin 25 = PB9/TIM4-CH4
		GIO_AFPP(GPIO_PinDef[25].gpio, GPIO_PinDef[25].mask);
		TIM4->CCR4 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
	default: break;
	}

}
#endif										//pwm

#if defined(USE_DAC)
//extended function
//output a 12-bit value on DACn ch 1
//DAC1 = PA4 = Pin 4
void DAC1Write(uint16_t val) {
	GIO_AFPP(GPIO_PinDef[4].gpio, GPIO_PinDef[4].mask);	//configure pin 4 as afio output
	DAC->DHR12R1 = val & 0x0ffful;			//bound the value to [0..4095]
	DAC->SWTRIGR|= (1<<0);					//output on DAC1 - cleared by hardware
}

//output a 12-bit value on DACn ch 2
//DAC2 = PA5 = Pin 5
void DAC2Write(uint16_t val) {
	GIO_AFPP(GPIO_PinDef[5].gpio, GPIO_PinDef[5].mask);	//configure pin 5 as afio output
	DAC->DHR12R2 = val & 0x0ffful;			//bound the value to [0..4095]
	DAC->SWTRIGR|= (1<<1);					//output on DAC2 - cleared by hardware
}
#endif										//dac

#if defined(USE_ADC1)
//analog to digital converter on ADC1
//ain/analog input channel: ain valid values: 0..15, 16=temperature sensor, 17=Vrefint
//***user needs to be configured as floating input***
uint16_t analogRead(AIN_TypeDef ain) {
	ADC1->SR &= ~(1<<1);					//clear the eoc flag
	//ADC1->CR1 = (ADC1->CR1 &~0x1f) | (ain & 0x1f);	//pick the adc channel
	//ADC1->CR2|= (1<<0);						//start the conversion
	ADC1->SQR3 = ain & 0x1f;					//define the first (and only) adc ch
	ADC1->CR2 |= (1<<22);						//start conversion
	while ((ADC1->SR & (1<<1)) == 0) continue;	//wait for conversion to end (EOC set at end of conversion)
	return ADC1->DR;						//return adc results
}
#endif										//adc1

#if defined(USE_EXTI)
//attach an exti
//pin 0..15
void attachInterrupt(PIN_TypeDef pin, void (*isrptr)(void), uint8_t mode) {
    GPIO_TypeDef *gpio = GPIO_PinDef[pin].gpio;
    uint16_t mask;                  // = GPIO_PinDef[pin].mask;
    uint16_t pos;                    //pin position

    //mode = mode & 0x0f
    //figure out the mask
    if (gpio == GPIOA) mask = 0x00;	//exti on GPIOx: 0x00->A, 0x01->B, ..., 0x06->G
    if (gpio == GPIOB) mask = 0x01;
    if (gpio == GPIOC) mask = 0x02;
    if (gpio == GPIOD) mask = 0x03;
    if (gpio == GPIOE) mask = 0x04;
    if (gpio == GPIOF) mask = 0x05;
    if (gpio == GPIOG) mask = 0x06;

    //scan for pin position
    for (pos = 0; pos < 16; pos ++)
        if (GPIO_PinDef[pin].mask & (1<<pos)) break;
    //not pos has the pin position

    //figure out the line 0..15
         if (pos < 4) AFIO->EXTICR[0] = (AFIO->EXTICR[0] &~(0x0f << (4*(pos- 0)))) | (mask << (4*(pos - 0)));  //set the line 0..4
    else if (pos < 8) AFIO->EXTICR[1] = (AFIO->EXTICR[1] &~(0x0f << (4*(pos- 4)))) | (mask << (4*(pos - 4)));  //set the line 5..8
    else if (pos <12) AFIO->EXTICR[2] = (AFIO->EXTICR[2] &~(0x0f << (4*(pos- 8)))) | (mask << (4*(pos - 8)));  //set the line 9..12
    else if (pos <16) AFIO->EXTICR[3] = (AFIO->EXTICR[3] &~(0x0f << (4*(pos-12)))) | (mask << (4*(pos -12)));  //set the line 13..16

    //figure out the trigger: rising or falling
    switch (mode) {
    case CHANGE:	EXTI->FTSR |= (1<<pos); EXTI->RTSR |= (1<<pos); break;		//set falling trigger
    case RISING: 	EXTI->RTSR |= (1<<pos); break;		//set rising trigger
    case FALLING:
    default: 		EXTI->FTSR |= (1<<pos); break;		//set falling trigger (default)
    }

