dannyf00/ARMduino/LPC122x/armduino_lpc12xx.c
    //configure the RX-PA2/TX-PA3 pins - GPIO clock assumed enabled here previously
    GIO_INFL(GPIO_PinDef[PA2].gpio, GPIO_PinDef[PA2].mask);			//RX as floating input
    GIO_AFPP(GPIO_PinDef[PA3].gpio, GPIO_PinDef[PA3].mask);			//TX as AFPP

}

//uart1 send a char
void serial2Write(unsigned char dat) {
    USART2->DR = dat;                        	//load the data buffer
    //while (!(USART2->SR & (1<<6)));    		//wait for the transmission to complete
    while (!(USART2->SR & USART_SR_TXE));    			//wait for the transmission buffer to be empty
}

//uart1 returns a char
unsigned char serial2Read(void) {
    while (!(USART2->SR & USART_SR_RXNE));  			//wait for the receipt buffer to be empty
    return USART2->DR;                       	//save the transmission buffer
}

//uart1 print a string
void serial2Print(unsigned char *str) {
	do {
		while (!(USART2->SR & USART_SR_TXE));			//wait for the transmission buffer to empty
		USART2->DR = *str++;					//load the data into transmission buffer
	} while (*str);
}

//uart1 print a string + return
void serial2Println(unsigned char *str) {
	serial2Print(str);						//print the string
	serial2Print("\n\r");					//print the return
}

//test if uart1 is available
//return true if transmission on uart1 has completed
uint8_t serial2Available(void) {
	return (USART2->SR & USART_SR_TC)?true:false;
}
#endif										//usart2

#if defined(USE_UART3)
//initialize uart3
void serial3Begin(uint32_t baudrate) {
    //configure uart1
    //route clock to uart1
    RCC->APB1ENR |= RCC_APB1ENR_USART3EN;

    USART3->CR1 &=~(1<<13);			//'0'->disable uart, '1'->enable uart
    USART3->CR1 = 	(0<<15) |		//'0'->oversample by 16, '1'->oversample by 8
    				(0<<13) |		//'0'->disable uart, '1'->enable uart
    				(0<<12) |		//'0'->1 start bit, 8 data bit, n stop bit, '1'->1 start bit, 9 data bit, n stop bit
    				(0<<11) |		//'0'->idle line, '1'->wake by address
    				(0<<10) |		//'0'->disable parity, '1'->enable parity
    				(0<< 9) |		//'0'->even parity, '1'->odd parity
    				(0<< 8) |		//'0'->PE interrupt disabled, '1'->pe interrupt enabled
    				(0<< 7) |		//'0'->tx empty interrupt disabled, '1'-tx empty interrupt enabled
    				(0<< 6) |		//'0'->transmission completion interrupt disabled, '1'->transmission complete interrupt enabled
    				(0<< 5) |		//'0'->rx not empty interrupt disabled, '1'->rx not empty interrupt enabled
    				(0<< 4) |		//'0'->idle interrupt disabled, '1'->idle interrupt enabled
    				(1<< 3) |		//'0'->disable tx, '1'->enable tx
    				(1<< 2) |		//'0'->disable rx, '1'->enable rx
    				(0<< 1) |		//'0'->disable receiver wake-up, '1'->enable receiver wake-up
    				(0<< 0) |		//'0'->no break char is transmitted, '1'->break char will be transmitted
    				0x00;
    USART3->CR2 = 	(0<<14) |		//'0'->LIN mode disabled, '1'->LIN mode enabled
    				(0<<12) |		//0->1 stop bit, 1->0.5 stop bit, 2->2 stop bit, 3 -> 1.5 stop bit
    				(0<<11) |		//'0'->SCLK pin disabled, '1'->SCLK pin enabled
    				(0<<10) |		//'0'->SCLK idles low, '1'->SCLK idles high
    				(0<< 9) |		//'0'->first clock transition is first data capture edge, '1'->second clock transition is the first data capture edge
    				(0<< 8) |		//'0'->clock pulse of the last data bit is not output to the sclk pin, '1'->clock pulse of the last data bit is output to the sclk pin
    				(0<< 6) |		//'0'->LIN break detection interrupt disabled, '1'->LIN break detection interrupt enabled
    				(0<< 5) |		//'0'->LIN break detection is 10-bit, '1'->LIN break detection is 11 bit
    				(0<< 0) |		//address of the uart node
    				0x00;
    USART3->CR3 = 	(0<<11) |		//'0'->three sample bit, '1'->one sample bit
    				(0<<10) |		//'0'->CTS interrupt disabled, '1'->CTS interrupt enabled
    				(0<< 9) |		//'0'->CTS disabled, '1'->CTS enabled
    				(0<< 8) |		//'0'->RTS interrupt disabled, '1'->RTS interrupt enabled
    				(0<< 5) |		//'0'->smartcard mode disabled, '1'->smartcard mode enabled
    				(0<< 4) |		//'0'->smartcard nack disabled, '1'->smartcard nack enabled
    				(0<< 3) |		//'0'->half duplex mode not selected, '1'->half duplex mode selected
    				(0<< 2) |		//'0'->irda normal mode, '1'->irda low-power mode
    				(0<< 1) |		//'0'->irda disabled, '1'->irda enabled
    				(0<< 0) |		//'0'->error interrupt disabled, '1'->error interrupt enabled
    				0x00;
    //set the baudrate register
    USART3->BRR = SystemCoreClock / baudrate / 2 / ((USART3->CR1 & (1<<15))?1:2);		//per datasheet, for OVER8=0 or 1
    USART3->DR = 0;					//reset the data register
    USART3->SR = 0;					//reset the data register
    //enable uart1
    USART3->CR1 |= (1<<13);			//'0'->disable uart, '1'->enable uart

    //configure the RX-PB11/TX-PB10 pins - GPIO clock assumed enabled here previously
    GIO_INFL(GPIO_PinDef[PB11].gpio, GPIO_PinDef[PB11].mask);		//RX as floating input
    GIO_AFPP(GPIO_PinDef[PB10].gpio, GPIO_PinDef[PB10].mask);		//TX as AFPP

}

//uart1 send a char
void serial3Write(unsigned char dat) {
    USART3->DR = dat;                        	//load the data buffer
    //while (!(USART3->SR & (1<<6)));    		//wait for the transmission to complete
    while (!(USART3->SR & USART_SR_TXE));    			//wait for the transmission buffer to be empty
}

//uart1 returns a char
unsigned char serial3Read(void) {
    while (!(USART3->SR & USART_SR_RXNE));  			//wait for the receipt buffer to be empty
    return USART3->DR;                       	//save the transmission buffer
}

//uart1 print a string
void serial3Print(unsigned char *str) {
	do {
		while (!(USART3->SR & USART_SR_TXE));			//wait for the transmission buffer to empty
		USART3->DR = *str++;					//load the data into transmission buffer
	} while (*str);
}

//uart1 print a string + return
void serial3Println(unsigned char *str) {
	serial3Print(str);						//print the string
	serial3Print("\n\r");					//print the return
}

//test if uart1 is available
//return true if transmission on uart1 has completed
uint8_t serial3Available(void) {
	return (USART3->SR & USART_SR_TC)?true:false;
}
#endif										//USART3

//initialize the chip
void chip_init(void) {
	//select the clock source
	//or use default clock

	//enable clock to GPIO
	/* Enable AHB clock to the GPIO domain. */
	LPC_SYSCON->SYSAHBCLKCTRL |= (1<<31);		//31:enable gpio0
	LPC_SYSCON->SYSAHBCLKCTRL |= (1<<30);		//30:enable gpio1
	LPC_SYSCON->SYSAHBCLKCTRL |= (1<<29);		//29:enable gpio2

#if defined(TIM1) && defined(USE_PWM1)
	//configure TIM1 for PWM generation
	//enable clock to TIM1
	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
	TIM1->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM1->CR2 = 0;							//default value
	TIM1->CNT = 0;							//reset counter
	TIM1->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM1->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM1->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM1->CCER = 0;							//disable all oc channels
	TIM1->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM1->CCMR2 = TIM1->CCMR1;				//replicate ccmr1 to ccmr2
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(TIM2) && defined(USE_PWM2)
	//configure TIM2 for PWM generation
	//enable clock to TIM2
	RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
	TIM2->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM2->CR2 = 0;							//default value
	TIM2->CNT = 0;							//reset counter
	TIM2->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM2->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM2->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM2->CCER = 0;							//disable all oc channels
	TIM2->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM2->CCMR2 = TIM2->CCMR1;				//replicate ccmr1 to ccmr2
	TIM2->CCR1 = TIM2->CCR2 = TIM2->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(TIM3) && defined(USE_PWM3)
	//configure TIM3 for PWM generation
	//enable clock to TIM3
	RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;
	TIM3->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM3->CR2 = 0;							//default value
	TIM3->CNT = 0;							//reset counter
	TIM3->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM3->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM3->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM3->CCER = 0;							//disable all oc channels
	TIM3->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM3->CCMR2 = TIM3->CCMR1;				//replicate ccmr1 to ccmr2
	TIM3->CCR1 = TIM3->CCR2 = TIM3->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(TIM4) && defined(USE_PWM4)
	//configure TIM4 for PWM generation
	//enable clock to TIM4
	RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;
	TIM4->CR1 = (0x00<<8) |					//00->division ratio is 1
				(1<<7) |					//1->auto reload is buffered. 0->auto reload is not buffered
				(1<<5) |					//0->edge aligned, 1/2/3->center aligned mode 1/2/3
				(0<<4) |					//0->upcounter, 1->downcounter
				(0<<3) |					//0->continuous counting; 1->one pulse mode
				(1<<0);						//1->enable timer, 0->disable timer
	TIM4->CR2 = 0;							//default value
	TIM4->CNT = 0;							//reset counter
	TIM4->PSC = (PWMOUT_PS) - 1;			//16-bit prescaler. 1->prescaler is 1:1
	TIM4->ARR = PWM_PR;						//auto reload value, 16-bit
	TIM4->CR1|= (1<<0);						//start the timer

	//set up OC1/2/3/4 channels
	TIM4->CCER = 0;							//disable all oc channels
	TIM4->CCMR1= (0<<15) |					//0->OC2 output clear disabled
				 (6<<12) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<11) |					//0->disable oc preload
				 (0<<10) |					//0->disable oc fast
				 (0<<8) |					//0->oc2 as output
				 (0<<7) |					//0->OC1 output clear disabled
				 (6<<4) |					//0b110: output compare mode 2 - 3-bit field
				 (0<<3) |					//0->disable oc preload
				 (0<<2) |					//0->disable oc fast
				 (0<<0) |					//0->oc1 as output
				 0x00;
	TIM4->CCMR2 = TIM4->CCMR1;				//replicate ccmr1 to ccmr2
	TIM4->CCR1 = TIM4->CCR2 = TIM4->CCR3 = TIM3->CCR4 = 0;
#endif

#if defined(USE_ADC1)
	//initialize adc
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;		//enable clock to ADC1
	ADC1->CR1 = (0<<23) |					//0->disable analog watchdog on regular channels
				(0<<22) |					//0->disable analog watchdog on injected channels
				(0<<13) |					//0->1 ch for discontinous conversion
				(0<<12) |					//0->discontinous mode for injected channels disabled
				(0<<11) |					//0->discontinous mode for regular channel disabled
				(0<<10) |					//0->automatic injected conversion disabled
				(0<< 9) |					//0->analog watchdog enabled on all channels
				(0<< 8) |					//0->scan mode disabled
				(0<< 7) |					//0->EOC interrupt on injected conversion disabled
				(0<< 6) |					//0->interrupt on analog watchdog disabled
				(0<< 5) |					//0->EOC interrupt on regular channels disabled
				(17<<0) |					//ADC channels, 0..17 (16=Temperature sensor, 17 = Vrefint)
				0x00;
	ADC1->CR2 = (1<<23) |					//0->temperature sensor disabled
				(0<<22) |					//1->start conversion on regular channel. 0->reset state. cleared by software
				(0<<21) |					//1->start conversion on injected channels. 0->reset state. cleared by s oftware
				(1<<20) |					//0->regular conversion on external event disabled
				(7<<17) |					//7->regular conversion triggered by software
				(0<<15) |					//0->injected conversion on external event disabled
				(7<<12) |					//7->injected conversion triggered by software
				(0<<11) |					//0->right aligned, 1->left aligned
				(0<< 3) |					//0->caliberatin stablized, 1->caliberatin initialized
				(0<< 2) |					//0->calibration complete, 1->initialize calibration
				(0<< 1) |					//0->single conversion mode, 1->continous conversion mode
				(1<< 0);					//1->adc1 on, 0->adc1 off
	//set adc sample time
	//0b111->239.5 cycles for all channels
	ADC1->SMPR1 = 	(ADC_SMPR << (3 * 7)) |
					(ADC_SMPR << (3 * 6)) |
					(ADC_SMPR << (3 * 5)) |
					(ADC_SMPR << (3 * 4)) |
					(ADC_SMPR << (3 * 3)) |
					(ADC_SMPR << (3 * 2)) |
					(ADC_SMPR << (3 * 1)) |
					(ADC_SMPR << (3 * 0)) |
					0x00;
	ADC1->SMPR2 = 	(ADC_SMPR << (3 * 9)) |
					(ADC_SMPR << (3 * 8)) |
					(ADC_SMPR << (3 * 7)) |
					(ADC_SMPR << (3 * 6)) |
					(ADC_SMPR << (3 * 5)) |
					(ADC_SMPR << (3 * 4)) |
					(ADC_SMPR << (3 * 3)) |
					(ADC_SMPR << (3 * 2)) |
					(ADC_SMPR << (3 * 1)) |
					(ADC_SMPR << (3 * 0)) |
					0x00;
	//set adc channel sequence
	ADC1->SQR3 = ADC1->SQR2 = ADC1->SQR1 = 0;							//0->1 conversion

	//optional: adc self-calibration
	//start caliberation
	ADC1->CR2 |= (1<<3);					//1->initialize calibration registers
	while ((ADC1->CR2) & (1<<3)) continue;	//wait for calibration to initialize
	ADC1->CR2 |= (1<<2);					//1->initialize calibration
	while ((ADC1->CR2) & (1<<2)) continue;	//wait for calibration to finish
	//now adc is calibrated
#endif

